* Extract API Traces Steps from Sh-archives in =stage= -Directory

List self extracting archives in =../stage= directory


#+name: ls-stage
#+BEGIN_SRC sh :eval no-export :results output :exports both :dir .
ls ../stage/*.sh
#+END_SRC

and observe self extracting archive files with names corresponding
/Possibility/ operators used in /Formal Modeling/

#+RESULTS: ls-stage
: ../stage/arch_isCompanyRegisteredFails.sh
: ../stage/arch_isCompanyRegistered.sh

Extract test cases for interface =registerCompany(post)= into
directory =virtual-system-test-input= with the following command:

#+BEGIN_SRC sh :eval no-export :dir . :results output
# Cleanup previous tests
rm virtual-system-test-input/*
# first extract
../stage/arch_isCompanyRegisteredFails.sh \
        --dir virtual-system-test-input \
          interface '/registerCompany\\(post\\)'  2>&1
# second extract
../stage/arch_isCompanyRegistered.sh \
       --dir virtual-system-test-input \
        interface '/registerCompany\\(post\\)' 2>&1 
#+END_SRC

#+RESULTS:
#+begin_example

Self create by jj@horsti

.. Checking SHA1 of ../stage/arch_isCompanyRegisteredFails.sh
.. Archive SHA1 ok
.. interface step=, interface=/registerCompany\\(post\\)
Step 1 interface /registerCompany(post)

Self create by jj@horsti

.. Checking SHA1 of ../stage/arch_isCompanyRegistered.sh
.. Archive SHA1 ok
.. interface step=, interface=/registerCompany\\(post\\)
Step 1 interface /registerCompany(post)
001-01-inp-TimeoffRegisterCompany.426759921aa71f5075e6fa6e33e828cfef8762ab
001-01-inp-TimeoffRegisterCompany.d6bb3494bdda70ae1ad54ebca1fc01ae890db84a
001-02-api-TimeoffRegisterCompany.426759921aa71f5075e6fa6e33e828cfef8762ab
001-02-api-TimeoffRegisterCompany.d6bb3494bdda70ae1ad54ebca1fc01ae890db84a
001-03-ret-TimeoffRegisterCompany.426759921aa71f5075e6fa6e33e828cfef8762ab
001-03-ret-TimeoffRegisterCompany.d6bb3494bdda70ae1ad54ebca1fc01ae890db84a
001-04-out-TimeoffRegisterCompany.426759921aa71f5075e6fa6e33e828cfef8762ab
001-04-out-TimeoffRegisterCompany.d6bb3494bdda70ae1ad54ebca1fc01ae890db84a
#+end_example

After these commands the content of =virtual-system-test-input=
contains files:

#+BEGIN_SRC sh :eval no-export :results output :dir . :exports results
ls -t virtual-system-test-input
#+END_SRC

#+RESULTS:
: 001-01-inp-TimeoffRegisterCompany.d6bb3494bdda70ae1ad54ebca1fc01ae890db84a
: 001-02-api-TimeoffRegisterCompany.d6bb3494bdda70ae1ad54ebca1fc01ae890db84a
: 001-03-ret-TimeoffRegisterCompany.d6bb3494bdda70ae1ad54ebca1fc01ae890db84a
: 001-04-out-TimeoffRegisterCompany.d6bb3494bdda70ae1ad54ebca1fc01ae890db84a
: 001-01-inp-TimeoffRegisterCompany.426759921aa71f5075e6fa6e33e828cfef8762ab
: 001-02-api-TimeoffRegisterCompany.426759921aa71f5075e6fa6e33e828cfef8762ab
: 001-03-ret-TimeoffRegisterCompany.426759921aa71f5075e6fa6e33e828cfef8762ab
: 001-04-out-TimeoffRegisterCompany.426759921aa71f5075e6fa6e33e828cfef8762ab

with files name using format 'STEP-TYPE-INTERFACE.SHA1', where

- *STEP*: is three digits for API trace step 
- *TYPE*: is Api trace step
  - =01-inp= formal state before executing API trace STEP
  - =02-api= formal parameter values passed to INTERFACE
  - =03-ret= formal parameter return values for calling INTERFACE
  - =04-out= formal state after executing API trace STEP
- *INTERFACE*: name of interface called in API trace STEP
- *SHA1*: suffix is SHA1 of the archive from, which the file was
  extracted identifying virtual system test, of which API trace step
  is part of


